logic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-08 Wed 18:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>logic</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index"> HOME </a>
</div><div id="content">
<h1 class="title">logic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35e1c9f">0.1. M₀ minimal logic</a></li>
<li><a href="#org524d984">0.2. J₀ intuitionistic logic</a></li>
<li><a href="#orgf86a975">0.3. K₀ classical logic</a></li>
</ul>
</li>
<li><a href="#org373e261">1. Derivation</a>
<ul>
<li><a href="#org2e67ed5">1.1. Proposition 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-org35e1c9f" class="outline-3">
<h3 id="org35e1c9f"><span class="section-number-3">0.1</span> M₀ minimal logic</h3>
</div>

<div id="outline-container-org524d984" class="outline-3">
<h3 id="org524d984"><span class="section-number-3">0.2</span> J₀ intuitionistic logic</h3>
</div>

<div id="outline-container-orgf86a975" class="outline-3">
<h3 id="orgf86a975"><span class="section-number-3">0.3</span> K₀ classical logic</h3>
</div>

<div id="outline-container-org373e261" class="outline-2">
<h2 id="org373e261"><span class="section-number-2">1</span> Derivation</h2>
<div class="outline-text-2" id="text-1">
<p>
The definition is a formula <code>C</code> is <i>derivable</i> in calculi M₀, J₀, or K₀ from a set Γ of assumptions.
</p>

<ol class="org-ol">
<li>assumptions Γ are a finite sequence of formulas A₁, &#x2026;, Aₙ</li>
<li>for each 1 ≤ i ≤ n, Aᵢ is one of
<ol class="org-ol">
<li>axiom of calculi</li>
<li>formula</li>
<li>can be obtained by modus ponens from several Aⱼ (where j &lt; i)</li>
</ol></li>
<li>Aₙ = C (the final formula is the target)</li>
</ol>

<p>
We say that A₁, &#x2026;, Aₙ is a <i>derivation</i> of C
</p>

<p>
We can write Γ ⊢ C
</p>
</div>

<div id="outline-container-org2e67ed5" class="outline-3">
<h3 id="org2e67ed5"><span class="section-number-3">1.1</span> Proposition 1</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If Γ ⊢ B and Δ ⊢ B ⥰ C, then Γ⋃Δ ⊢ C
</p>

<ol class="org-ol">
<li>By definition, Γ has final assumption Bₙ = B</li>
<li>Δ has final assumption Cₘ = B ⥰ C</li>
<li>Thus, Γ⋃Δ has enough information to produce C, by Bₙ is B and Cₘ is B ⥰ C</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-03-08 Wed 18:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
